linux/tutorials/org/howto.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-06-22 Tue 13:34 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>How To Write Your Lab Report With Emacs Org-mode</title>
<meta name="generator" content="Org mode">
<meta name="author" content="WANG Xiaolin">
<link rel="stylesheet" href="https://cs6.swfu.edu.cn/org.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">How To Write Your Lab Report With Emacs Org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ac5387">1. Make a directory named with your student ID, and get into it</a></li>
<li><a href="#org7dba614">2. Get the <i>report template org file</i> into this directory</a></li>
<li><a href="#orgae42516">3. Open this file with emacs, and edit it</a></li>
<li><a href="#orge1df251">4. Save your org file, and Export it to a HTML file</a></li>
<li><a href="#orgd0b626f">5. Open the HTML file in your web browser</a></li>
<li><a href="#org9435861">6. If everything looks good, you can now make a tar ball of your current directory</a></li>
<li><a href="#orgd31f12a">7. Send this <b>tgz</b> file to me via email</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6ac5387" class="outline-2">
<h2 id="org6ac5387"><span class="section-number-2">1.</span> Make a directory named with your student ID, and get into it</h2>
<div class="outline-text-2" id="text-1">
<p>
For example:
</p>
<pre class="example">
mkdir 20091152888 &amp;&amp; cd 20091152888
</pre>
</div>
</div>
<div id="outline-container-org7dba614" class="outline-2">
<h2 id="org7dba614"><span class="section-number-2">2.</span> Get the <i>report template org file</i> into this directory</h2>
<div class="outline-text-2" id="text-2">
<p>
For example:
</p>
<pre class="example">
wget http://cs2.swfu.edu.cn/~wx672/lecture_notes/os/sample-report/20081152xxx.org -O 20091152888.org
</pre>
</div>
</div>
<div id="outline-container-orgae42516" class="outline-2">
<h2 id="orgae42516"><span class="section-number-2">3.</span> Open this file with emacs, and edit it</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
emacs 20091152888.org&amp;
</pre>
</div>
<ol class="org-ol">
<li><a id="org65d6712"></a>Don't know how to use emacs?<br>
<div class="outline-text-3" id="text-3-1">
<pre class="example">
C-h t
</pre>

<table>
<caption class="t-above"><span class="table-number">Table 1:</span> Frequently used emacs shortcut keys</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">C-x C-f</td>
<td class="org-left">C-x C-s</td>
<td class="org-left">C-x C-c</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-g</td>
<td class="org-left">C-j</td>
<td class="org-left">C-i</td>
<td class="org-left">C-/</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-k</td>
<td class="org-left">C-y</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-d</td>
<td class="org-left">M-d</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-@</td>
<td class="org-left">C-SPACE</td>
<td class="org-left">C-x h</td>
<td class="org-left">C-w</td>
<td class="org-left">C-INSERT</td>
</tr>

<tr>
<td class="org-left">C-a</td>
<td class="org-left">C-e</td>
<td class="org-left">C-f</td>
<td class="org-left">C-b</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-n</td>
<td class="org-left">C-p</td>
<td class="org-left">C-v</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">C-x 2</td>
<td class="org-left">C-x 3</td>
<td class="org-left">C-x 0</td>
<td class="org-left">C-x 1</td>
<td class="org-left">C-x o</td>
</tr>

<tr>
<td class="org-left">C-h i</td>
<td class="org-left">C-h t</td>
<td class="org-left">C-h k</td>
<td class="org-left">C-h f</td>
<td class="org-left">C-h v</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="org85965cd"></a>Don't know how to use Org-mode?<br>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
C-h i
m org
</pre>

<table>
<caption class="t-above"><span class="table-number">Table 2:</span> Frequently used Org-mode shortcut keys</caption>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">TAB</td>
<td class="org-left">C-return</td>
<td class="org-left">M-return</td>
</tr>

<tr>
<td class="org-left">C-c C-n</td>
<td class="org-left">C-c C-p</td>
<td class="org-left">C-c C-l</td>
</tr>

<tr>
<td class="org-left">&lt;e[TAB]</td>
<td class="org-left">&lt;I[TAB]</td>
<td class="org-left">C-c '</td>
</tr>

<tr>
<td class="org-left">S-arrow</td>
<td class="org-left">M-arrow</td>
<td class="org-left">S-M-arrow</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>

<div id="outline-container-orge1df251" class="outline-2">
<h2 id="orge1df251"><span class="section-number-2">4.</span> Save your org file, and Export it to a HTML file</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
C-x C-s
C-c C-e h
</pre>
</div>
</div>
<div id="outline-container-orgd0b626f" class="outline-2">
<h2 id="orgd0b626f"><span class="section-number-2">5.</span> Open the HTML file in your web browser</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><p>
Switch to your newly generated HTML file
</p>
<pre class="example">
C-x C-b
</pre>

<p>
Select the <code>20091152888.html</code> buffer
</p></li>
<li><p>
Open it
</p>
<pre class="example">
C-c C-z v
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-org9435861" class="outline-2">
<h2 id="org9435861"><span class="section-number-2">6.</span> If everything looks good, you can now make a tar ball of your current directory</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
cd ..
tar zcf 20091152888.tgz 20091152888/
ls
</pre>
</div>
</div>
<div id="outline-container-orgd31f12a" class="outline-2">
<h2 id="orgd31f12a"><span class="section-number-2">7.</span> Send this <b>tgz</b> file to me via email</h2>
<div class="outline-text-2" id="text-7">
<p>
All done!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: WANG Xiaolin</p>
<p class="date">Created: 2021-06-22 Tue 13:34</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
